{
    "post": "\nhttps://remaster.realmofthemadgod.com/wp-content/uploads/2022/12/ L B_steamcover.png\n Realmers!\n Last week we updated you on the progress on the  Seasonal  Gratitude  Event.  Now it’s time to reveal if you, as a community, were able to beat our objectives or if the  Marble  Colossus was able to stay strong. \n Additionally, we are launching our first in-game  Leaderboard  Event today!  Go check out all the information about that down below.\n“ Seasonal  Gratitude”  Event\n Well it shouldn’t be a surprise but the community was able to beat all 3  Objectives on their  Seasonal  Characters!  This means that you have earned one week of free  O3, and  O3 chest event and every player that contributed to the objective will be granted the new  Chibi  Oryx  Pet  Skin! Let’s have a look at what you were able to archive. Objective 1:  Required 12750  Points to complete, you were able to collect 13054  Points.  That’s 102% of the goal.\n Objective 2:  Required 8500  Points to complete, you were able to collect 16690  Points.  That’s 196% of the goal.\n Objective 3:  Required 4675  Points to complete, you were able to collect 7230  Points.  That’s 155% of the goal.\n The  O3 event is going live today at 12  U T C and will end on the 12th of  December at 12  U T C. \n O3  Chest  Loot\n\n\n Angel’s  Fanfare\n Avarice\n Backpack\n Ballistic  Star\n Battalion  Banner\n Centaur’s  Shielding\n Chancellor’s  Cranium\n Chaotic  Scripture\n Collector’s  Monocle\n Diplomatic  Robe\n Divine  Coronation\n Divinity\n Enforcer\n Exalted  God’s  Horn\n Gambler’s  Fate\n Genesis  Spell\n Gladiator  Guard\n Greater  Potion of  Life\n Greater  Potion of  Mana\n Harmonious  Harp\n Heavenly  Halo\n Helmet  Rune\n Loot  Drop  Potion\n Loot  Tier  Potion\n Lucky  Clover\n Lumiaire\n Mystery  Cloth ( Large)\n Mystery  Cloth ( Small)\n Mystery  Dye ( Accessory)\n Mystery  Dye ( Clothing)\n Mystery  Stat  Pot\n Oryx’s  Escutcheon\n Paramount  Mystery  Skin\n Potion of  Max  Level\n Shard of the  Mad  God x1\n Shield  Rune\n Superior\n Superior  Mystery  Skin\n Sword  Rune\n Turncoat  Cape\n Vesture of  Duality\n Wine  Cellar  Incantation\n Wings of  Sanctity\n\n Leaderboard  Event\n Today the first in-game  Leaderboard event “ Sulfurous  Speed” starts in  Realm of the  Mad  God!  We will start this very simple for now since it’s the introduction of the  Leaderboards feature, but in the future you can expect us to set up different kinds of rewards.\n The  Leaderboard  Event starts today at 12  U T C and ends on the 12th of  December at 12  U T C. Throw yourself into the  Sulfurous  Wetlands and beat it as fast as possible!  It doesn’t matter if you are using a regular character or a seasonal one.   Additionally all players will gain 1.5  X P and  Loot from the  Dungeon.\n Let’s have a look at the prizes.\n Rank 1 – 99\n\n Chibi  Heart of the  Wetlands  Pet  Skin\n“ The  Sulfurous  Speedster”  Title\n\n Rank 100 – 999 \n\n“ The  Sulfurous  Speedster”  Title\n\n How does it work?\n For those of you wondering how time is tracked for a  Leaderboard, it works like this.  Please bear in mind we are still fine tuning this feature so the implementation is subject to changes later.\n\n Whenever a new dungeon is opened and the first player “enters” it, an internal timer starts.\n The timer stops when the main boss is killed.\n That time elapsed will be added to the score of all players present in the dungeon at that moment, but only if it’s their personal best.\n If you are outside the dungeon/killed at that moment, it doesn’t count.\n\n The system allows you to play as much as you want in the dungeon with any groups or solo, ensuring only your personal best is the one that counts for your ranking position. \n Remember we might add additional rules on top of this depending on the configuration of the event, like  Leaderboards restricted to “solo” dungeons and such.  In all cases we will always respect the “personal best is what defines your score” rule.\n In a  Leaderboard, your score will appear as “ N/ A” if your score hasn’t been correctly registered.  This is because you don’t have a “personal best” yet!\n A note of interest is that the  Leaderboards by design do not track if you get out and then back in to the dungeon, so while the portal is open you have a small time window to nexus and reenter, but you need to get back before it closes and the boss is killed or the timer won’t register you.  Remember again the timer starts as soon as the first player enters the dungeon!\n We hope to read your feedback and impressions on the  Leaderboards system.\n",
    "channel": 907777822507020378
}